# ノンパラメトリック検定(2): 順位の利用
# 2標本のデータ値の大小の順位を利用するのが順位和検定法である．
# ウィルコクソンの順位和検定: 正規性を崩しても成立する．ただし等分散性が満たされている必要がある．
# マン・ウィットニーのU検定: 2つの標本の合併順位を使い順位和を求めるところはウィルコクソン検定と同じであるが，
# それを発展してU統計量を計算してU検定を行う．分布型が同じである必要がある
d1 <- c(44, 48, 36, 32, 51, 45, 54, 56)
d2 <- c(32, 40, 44, 44, 34, 30, 26)
wilcox.test(d1, d2)

install.packages("exactRankTests")
library(exactRankTests)
wilcox.exact(d1, d2)
# 2つの標本で等分散性が保証されていない限りはマン・ウィットニーのU検定も使えない

# フリグナー・ポリセロ検定およびブルネル・ムンツェル検定
# 2標本の代表値の検定で等分散性も正規性も前提としない位置母数の検定法
# フリグナー・ボリセロ検定: 2つの標本AとBで，標本Aのデータで標本Bより小さいものを数え上げ，
# 同時に，標本Bのデータで標本Aより小さいものを数え上げ，それぞれ順位和をとる．
# 同じデータには中間順位を与える．次に平均順位から位置母数を推定するため検定統計量zを計算する．
dA <- c(
  10.3, 10.6, 10.9, 10.9, 10.9, 11.0, 11.2, 12.0,
  12.0, 12.5, 12.6, 12.6, 14.2, 14.6, 15.0, 15.6
)
dB <- c(
  12.1, 12.1, 12.2, 12.4, 12.4, 12.6, 12.7, 12.8, 12.9, 13.0, 13.0,
  13.0, 13.0, 13.4, 13.5, 13.6, 13.7, 13.7, 13.9, 13.9, 13.9, 14.0, 14.0
)
var.test(dA, dB)

install.packages("car")
library(car)
d <- data.frame(score = c(dA, dB), group = c(rep("a", 16), rep("b", 23)))
leveneTest(d$score ~ factor(d$group))

install.packages("NSM3")
library(NSM3)
pFligPoli(dA, dB, method = NA, n.mc = 10000)

# ブルネル・ムンツェル検定
# 帰無仮説では2つの標本が同じ性質をもつとは考えず．両群から1つずつデータを取出したとき，
# どちらかが大きい確率は1/2であるという帰無仮説を検定する．
install.packages("lawstat")
library(lawstat)
brunner.munzel.test(dA, dB)

# 3つの標本の順位和の検定: クラスカリ・ウォリスの順位和検定
# 同一分布関数を持つ，複数の水準の標本を検定するのだから，
# 正規分布でなかったとしても分布型は同じでなければいけない．まして等分散の条件は必要である．
d1 <- c(14.0, 12.1, 9.6, 8.2, 10.2)
d2 <- c(8.4, 5.1, 5.5, 6.6, 6.3)
d3 <- c(6.9, 7.3, 5.8, 4.1, 5.4)
kruskal.test(list(d1, d2, d3))

kruskal.test(c(d1, d2, d3), factor(rep(1:3, c(5, 5, 5))))
1 - pf(5.95, 3, 26)

d1 <- c(7.68, 7.69, 7.70, 7.70, 7.72, 7.73, 7.73, 7.76)
d2 <- c(7.71, 7.73, 7.74, 7.74, 7.78, 7.78, 7.80, 7.81)
d3 <- c(7.74, 7.75, 7.77, 7.78, 7.80, 7.81, 7.84)
d4 <- c(7.71, 7.71, 7.74, 7.79, 7.81, 7.85, 7.87, 7.91)
kruskal.test(list(d1, d2, d3, d4))

# 多重比較法: ネメニィ・ダン検定とスチール・ドワス検定

install.packages("PMCMRplus")
library(PMCMRplus)
d1 <- c(14.0, 12.1, 9.6, 8.2, 10.2)
d2 <- c(8.4, 5.1, 5.5, 6.6, 6.3)
d3 <- c(6.9, 7.3, 5.8, 4.1, 5.4)
PMCMRplus::kwAllPairsNemenyiTest(list(d1, d2, d3))

# スチール・ドワス検定
# 順位和ではなく，平均順位をつかう検定法
source("http://aoki2.si.gunma-u.ac.jp/R/src/Steel-Dwass.R", encoding = "euc-jp")
data <- c(14.0, 12.1, 9.6, 8.2, 10.2, 8.4, 5.1, 5.5, 6.6, 6.3, 6.9, 7.3, 5.8, 4.1, 5.4)
group <- rep(1:3, c(5, 5, 5))
Steel.Dwass(data, group)

# スピアマンの順位相関: ρは順位の差を総和して2変量の関係の有無を定量化する方法である．
d <- read.csv("../dataset/table13-9.csv")
plot(d$a, d$b, xlab = "alpha", ylab = "beta", type = "p")
cor.test(d$a, d$b, method = "s")
cor.test(d$a, d$b)

d <- read.csv("../dataset/table13-10.csv")
d
plot(d$math, d$biol, xlab = "biology", ylab = "math", xlim = c(30, 100), ylim = c(30, 100))
cor.test(d$math, d$biol)
cor.test(d$math, d$biol, method = "s")

# (1) パラメトリック法は検出力が高く，ノンパラメトリック法は検出力が低いという誤解
# パラメトリック法が正規性や等分散性を満たしていないときには検出力の高いノンパラメトリック法は必ずと行ってよいほど存在している．
# (2) ノンパラメトリック法では，標本データの分布は何であっても良い，分布とは無関係であるとの誤解
# 2つの標本のデータの分布が偏って異なっている場合には多くの検定法は検出力が低下する．
# 等分散性や正規性が満たされなくても検出力が高い検定法もある．
