# 4. 推定と誤差
# 標準誤差sₓ̄(SEM): 標本平均の分布の標準偏差，標本平均が真の平均からどの程度ずれることがどのくらい起こるかを表す．
# 標本誤差: 母集団の性質を標本から推定するときに生じる誤差，ばらつき
# スチューデントのt分布: (X̄-μ) / (s / √n)
# 95%信頼区間(95% CI): サンプリングを何度も行ったときに平均的にみて20回中19回，真の平均が入ってくる区間．これを求めることで母平均を推定する．
# 統計的検定: 母集団に関するある仮説のもとで，今観察されたデータがどの程度起こりやすいかを調べること.

d <- rnorm(2000, mean = 145.5, sd = 4.0)
hist(d)
mean(d)

n <- 20
x <- sample(d, n, replace = F)
x <- c(
  149.6, 150.8, 143.4, 149.1, 145.7, 144.6, 146.9, 141.1, 141.1, 138.7,
  154.3, 141.7, 142.5, 140.3, 148.4, 155.4, 148.4, 144.8, 143.0, 152.0
)
mean(x)

t.test(x, mu = 145.5)

x <- c(
  147.5, 151.5, 153.2, 144.8, 142.8, 147.5, 147.9, 151.0, 147.0, 152.8,
  151.1, 144.0, 146.6, 146.3, 145.8, 145.3, 147.3, 153.9, 156.9, 146.3
)
mean(x)

t.test(x, mu = 145.5)

x <- seq(-3, 3, 0.1)
y <- dt(x, df = 19)
plot(x, y, type = "l")
qt(0.025, df = 19)
qt(1 - 0.025, df = 19)
