# 8. 相関
# 相関: 2つの変数が相互関連すること．因果関係があるかどうかはわからない
# 相関関係を定量化するにはピアソンの積率相関係数rを計算することが一般的

r <- 0.5 # 相関係数
x <- rnorm(1000, mean = 0, sd = 5)
y <- r * x + sqrt(1 - r^2) * rnorm(1000, mean = 0, sd = 5)
cor(x, y)
plot(x, y)

# 傾きの大きさは相関係数に関係がない
# 傾きが異なるのに対して相関係数はともに0.9
r <- 0.9
x <- rnorm(1000, 0, 5)
y <- r * x + sqrt(1 - r^2) * rnorm(1000, 0, 5)
y2 <- 0.5 * y
plot(
  x, y2,
  xlim = c(-20, 20), ylim = c(-20, 20),
  xlab = "", ylab = "", cex = 0.1, pch = 19
)

r <- 0.9
x <- rnorm(1000, 0, 2)
y <- r * x + sqrt(1 - r^2) * rnorm(1000, 0, 2)
y2 <- 2 * y
plot(
  x, y2,
  xlim = c(-20, 20), ylim = c(-20, 20),
  xlab = "", ylab = "", cex = 0.1, pch = 19
)

# 前提として2変量XとYの療法が正規分布に従う
# 母集団の相関係数rは0である という帰無仮説のもと，相関係数の帰無仮説は一般にt検定を使って実施する．
x <- c(
  11.7, 11.9, 10.1, 13.6, 12.8, 10.5,
  9.8, 10.9, 11.6, 11.8, 13.1, 12.4, 12.2
)
y <- c(8.2, 8.2, 7.1, 9.2, 8.7, 7.7, 6.5, 7.7, 7.8, 8.0, 9.3, 8.6, 8.3)
plot(x, y)
cor.test(x, y)
# 帰無仮説は棄却されたので母集団の相関係数rは0ではないが採択される．
# 実際に解析するときはP値が有意水準を下回ることを確認した上で相関係数rの値を使って確認し評価する必要がある．
